import type { Zikr } from '../types';

export const morningAzkar: Zikr[] = [
  {
    category: "أذكار الصباح",
    count: "1",
    description: "آية الكرسي",
    reference: "رواه الحاكم وابن حبان",
    content: "الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤده حفظهما وهو العلي العظيم"
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "دعاء",
    reference: "رواه أحمد",
    content: "أصبحنا على فطرة الإسلام وكلِمة الإخلاص، ودين نبينا محمد صلى الله عليه وسلم، ومِلَّةِ أبينا إبراهيم، حنيفاً مسلماً، وما كان من المشركين."
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "دعاء",
    reference: "رواه أصحاب السنن",
    content: "رضيت بالله ربا، وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبياً."
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "دعاء",
    reference: "رواه ابن ماجه",
    content: "اللهم إني أسألك علماً نافعاً، ورزقاً طيباً، وعملاً متقبلاً."
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "دعاء",
    reference: "رواه أصحاب السنن عدا النسائي",
    content: "اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور."
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "تهليل",
    reference: 'رواه البزار والطبراني في "الدعاء"',
    content: "لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير."
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "دعاء",
    reference: "رواه البزار",
    content: "يا حيُّ يا قيوم برحمتك أستغيثُ، أصلح لي شأني كله، ولا تَكلني إلى نفسي طَرْفَةَ عين أبدًا."
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "سيد الاستغفار",
    reference: "رواه البخاري",
    content: "اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدُك, وأنا على عهدِك ووعدِك ما استطعتُ، أعوذ بك من شر ما صنعتُ، أبوءُ لَكَ بنعمتكَ عَلَيَّ، وأبوء بذنبي، فاغفر لي، فإنه لا يغفرُ الذنوب إلا أنت."
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "دعاء",
    reference: "رواه الترمذي",
    content: "اللهم فاطر السموات والأرض، عالم الغيب والشهادة، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت, أعوذ بك من شرّ نفسي، ومن شرّ الشيطان وشركه، وأن أقترف على نفسي سوءا، أو أجره إلى مسلم."
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "دعاء",
    reference: "رواه مسلم",
    content: "أصبحنا وأصبح الملك لله، والحمد لله ولا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، أسألك خير ما في هذا اليوم، وخير ما بعده، وأعوذ بك من شر هذا اليوم، وشر ما بعده، وأعوذ بك من الكسل وسوء الكبر، وأعوذ بك من عذاب النار وعذاب في القبر."
  },
  {
    category: "أذكار الصباح",
    count: "1",
    description: "دعاء",
    reference: "رواه أبو داود وابن ماجه",
    content: "اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي، وآمن روعاتي، واحفظني من بين يدي، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بك أن أغتال من تحتي."
  },
  {
    category: "أذكار الصباح",
    count: "3",
    description: "دعاء للحفظ",
    reference: "رواه أصحاب السنن عدا النسائي",
    content: "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم."
  },
  {
    category: "أذكار الصباح",
    count: "3",
    description: "تسبيح",
    reference: "رواه مسلم",
    content: "سبحان الله عدد خلقه، سبحان الله رضا نفسه، سبحان الله زنة عرشه، سبحان الله مداد كلماته."
  },
  {
    category: "أذكار الصباح",
    count: "3",
    description: "دعاء للعافية",
    reference: "رواه أبو داود",
    content: "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت، اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت."
  },
  {
    category: "أذكار الصباح",
    count: "3",
    description: "المعوذات",
    reference: "رواه الترمذي",
    content: "قراءة سور: الإخلاص، والفلق، والناس."
  },
  {
    category: "أذكار الصباح",
    count: "7",
    description: "دعاء الكفاية",
    reference: "رواه أبو داود",
    content: "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم"
  },
  {
    category: "أذكار الصباح",
    count: "4",
    description: "دعاء",
    reference: "أبو داود والترمذي",
    content: "اللهم إني أصبحت، أُشهدك وأُشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله، وحدك لا شريك لك وأن محمداً عبدك ورسولك."
  },
  {
    category: "أذكار الصباح",
    count: "10",
    description: "تهليل",
    reference: "رواه ابن حبان",
    content: "لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، يحيي ويميت، وهو على كل شيء قدير."
  },
  {
    category: "أذكار الصباح",
    count: "100",
    description: "تسبيح",
    reference: "رواه مسلم",
    content: "سبحان الله وبحمده. أو: سبحان الله العظيم وبحمده."
  },
  {
    category: "أذكار الصباح",
    count: "100",
    description: "استغفار",
    reference: "رواه ابن أبي شيبة",
    content: "أستغفر الله."
  },
  {
    category: "أذكار الصباح",
    count: "100",
    description: "تسبيح وتهليل",
    reference: "رواه الترمذي",
    content: "سبحان الله، والحمد لله، والله أكبر, لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، وهوعلى كل شيء قدير."
  }
];

export const eveningAzkar: Zikr[] = [
  {
    category: "أذكار المساء",
    count: "1",
    description: "آية الكرسي",
    reference: "رواه الحاكم وابن حبان",
    content: "الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤده حفظهما وهو العلي العظيم"
  },
  {
    category: "أذكار المساء",
    count: "1",
    description: "دعاء",
    reference: "رواه أحمد",
    content: "أمسينا على فطرة الإسلام وكلِمة الإخلاص، ودين نبينا محمد صلى الله عليه وسلم، ومِلَّةِ أبينا إبراهيم، حنيفاً مسلماً، وما كان من المشركين."
  },
  {
    category: "أذكار المساء",
    count: "1",
    description: "دعاء",
    reference: "رواه أصحاب السنن",
    content: "رضيت بالله ربا، وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبياً."
  },
  {
    category: "أذكار المساء",
    count: "1",
    description: "دعاء",
    reference: "رواه أصحاب السنن عدا النسائي",
    content: "اللهم بك أمسينا، وبك أصبحنا، وبك نحيا، وبك نموت، وإليك المصير."
  },
  {
    category: "أذكار المساء",
    count: "1",
    description: "تهليل",
    reference: 'رواه البزار والطبراني في "الدعاء"',
    content: "لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير."
  },
  {
    category: "أذكار المساء",
    count: "1",
    description: "دعاء",
    reference: "رواه البزار",
    content: "يا حيُّ يا قيوم برحمتك أستغيثُ، أصلح لي شأني كله، ولا تَكلني إلى نفسي طَرْفَةَ عين أبدًا."
  },
  {
    category: "أذكار المساء",
    count: "1",
    description: "سيد الاستغفار",
    reference: "رواه البخاري",
    content: "اللهم أنت ربي، لا إله إلا أنت، خلقتني وأنا عبدُك, وأنا على عهدِك ووعدِك ما استطعتُ، أعوذ بك من شر ما صنعتُ، أبوءُ لَكَ بنعمتكَ عَلَيَّ، وأبوء بذنبي، فاغفر لي، فإنه لا يغفرُ الذنوب إلا أنت."
  },
  {
    category: "أذكار المساء",
    count: "1",
    description: "دعاء",
    reference: "رواه الترمذي",
    content: "اللهم فاطر السموات والأرض، عالم الغيب والشهادة، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت, أعوذ بك من شرّ نفسي، ومن شرّ الشيطان وشركه، وأن أقترف على نفسي سوءا، أو أجرُّه إلى مسلم."
  },
  {
    category: "أذكار المساء",
    count: "1",
    description: "دعاء",
    reference: "رواه مسلم",
    content: "أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، اللهم إني أسألك من خير ما في هذه الليلة، وخير ما بعدها، اللهم إني أعوذ بك من شر هذه الليلة وشر ما بعدها، اللهم إني أعوذ بك من الكسل وسوء الكبر، وأعوذ بك من عذاب في النار وعذاب في القبر."
  },
  {
    category: "أذكار المساء",
    count: "1",
    description: "دعاء",
    reference: "رواه أبو داود وابن ماجه",
    content: "اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي، وآمن روعاتي، واحفظني من بين يدي، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بك أن أغتال من تحتي."
  },
  {
    category: "أذكار المساء",
    count: "3",
    description: "دعاء للحفظ",
    reference: "رواه أصحاب السنن عدا النسائي",
    content: "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم."
  },
  {
    category: "أذكار المساء",
    count: "3",
    description: "استعاذة",
    reference: "رواه مسلم",
    content: "أعوذ بكلمات الله التامَّات من شر ما خلق."
  },
  {
    category: "أذكار المساء",
    count: "3",
    description: "دعاء للعافية",
    reference: "رواه أبو داود",
    content: "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت، اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت."
  },
  {
    category: "أذكار المساء",
    count: "3",
    description: "المعوذات",
    reference: "رواه الترمذي",
    content: "قراءة سور: الإخلاص، والفلق، والناس."
  },
  {
    category: "أذكار المساء",
    count: "7",
    description: "دعاء الكفاية",
    reference: "رواه أبو داود",
    content: "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم"
  },
  {
    category: "أذكار المساء",
    count: "4",
    description: "دعاء",
    reference: "رواه أبو داود والترمذي",
    content: "اللهم إني أمسيت أُشهدك، وأُشهد حملة عرشك، وملائكتك وجميع خلقك، أنك أنت الله، وحدك لا شريك لك، وأن محمداً عبدك ورسولك."
  },
  {
    category: "أذكار المساء",
    count: "10",
    description: "تهليل",
    reference: "رواه ابن حبان",
    content: "لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، يحيي ويميت، وهو على كل شيء قدير."
  },
  {
    category: "أذكار المساء",
    count: "100",
    description: "تسبيح",
    reference: "رواه مسلم",
    content: "سبحان الله وبحمده. أو: سبحان الله العظيم وبحمده."
  },
  {
    category: "أذكار المساء",
    count: "100",
    description: "استغفار",
    reference: "رواه ابن أبي شيبة",
    content: "أستغفر الله."
  },
  {
    category: "أذكار المساء",
    count: "100",
    description: "تسبيح وتهليل",
    reference: "رواه الترمذي",
    content: "سبحان الله، والحمد لله، والله أكبر, لا إله إلا الله وحده، لا شريك له، له الملك، وله الحمد، وهوعلى كل شيء قدير."
  }
];
